ProgessBase/DataProcessors/ПомощникПодготовкиУведомленияОКонтролируемыхСделках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПодготовкиУведомленияОКонтролируемыхСделках</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОКонтролируемыхСделках</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ProgessBase/InformationRegisters/ГраницыКонтролируемостиСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГраницыКонтролируемостиСделок</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредельнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсобенностьОтнесенияСделкиККонтролируемой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиОтнесенияСделокККонтролируемым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ОсобенностиОтнесенияСделокККонтролируемым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ОсобенностиОтнесенияСделокККонтролируемым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаПлательщикиНДПИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаНаСпецрежимах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаимозависимыеЛицаОсобаяЭкономическаяЗона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимальнаяСуммаДляВключенияВУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимыеИностранныеЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/DataProcessors/ПомощникПодготовкиУведомленияОКонтролируемыхСделках/Forms/ФормаГраницыВключенияСделок/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Процедура ЗаписатьГраницу(ВидГраницы, Период, ПредельнаяСумма)
	
	НаборЗаписей = РегистрыСведений.ГраницыКонтролируемостиСделок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОсобенностьОтнесенияСделкиККонтролируемой.Значение = ВидГраницы;
	НаборЗаписей.Отбор.ОсобенностьОтнесенияСделкиККонтролируемой.Использование = Истина;
	НаборЗаписей.Отбор.Период.Значение = Период;
	НаборЗаписей.Отбор.Период.Использование = Истина;
	Запись = НаборЗаписей.Добавить();
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = ВидГраницы;
	Запись.Период = Период;
	Запись.ПредельнаяСумма = ПредельнаяСумма;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГраницы()
	
	СуществующиеГраницы = Новый Структура("ГраницаРФОбщая, ГраницаРФНДПИ, ГраницаСпецрежим, ГраницаРФПрибыль, ГраницаРФОЭЗ, ГраницаИностранныеНезависимыеЛица, ГраницаОбщая");
	ЗаполнитьГраницы(СуществующиеГраницы);
	ПериодДляЗаписи = Дата(Объект.ОтчетныйГод, 1, 1);
	Если СуществующиеГраницы.ГраницаОбщая <> ГраницаОбщая Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление, ПериодДляЗаписи, ГраницаОбщая);
	КонецЕсли;
	Если СуществующиеГраницы.ГраницаРФОбщая <> ГраницаРФОбщая Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица, ПериодДляЗаписи, ГраницаРФОбщая);
	КонецЕсли;
	Если СуществующиеГраницы.ГраницаРФНДПИ <> ГраницаРФНДПИ Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ, ПериодДляЗаписи, ГраницаРФНДПИ);
	КонецЕсли;
	Если СуществующиеГраницы.ГраницаСпецрежим <> ГраницаСпецрежим Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах, ПериодДляЗаписи, ГраницаСпецрежим);
	КонецЕсли;
	Если СуществующиеГраницы.ГраницаРФПрибыль <> ГраницаРФПрибыль Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль, ПериодДляЗаписи, ГраницаРФПрибыль);
	КонецЕсли;
	Если СуществующиеГраницы.ГраницаРФОЭЗ <> ГраницаРФОЭЗ Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона, ПериодДляЗаписи, ГраницаРФОЭЗ);
	КонецЕсли;
	Если СуществующиеГраницы.ГраницаИностранныеНезависимыеЛица <> ГраницаИностранныеНезависимыеЛица Тогда
		ЗаписатьГраницу(Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица, ПериодДляЗаписи, ГраницаИностранныеНезависимыеЛица);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГраницы(ОбъектЗаполнения)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ОтчетныйГод", Дата(Объект.ОтчетныйГод, 1, 1));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаРФОбщая,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаРФНДПИ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСпецрежим,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаРФПрибыль,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаРФОЭЗ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаИностранныеНезависимыеЛица,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаОбщая
	|ИЗ
	|	РегистрСведений.ГраницыКонтролируемостиСделок.СрезПоследних(КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД), ) КАК ГраницыКонтролируемостиСделокСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОбъектЗаполнения, Выборка);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);

	ЭтаФорма.Заголовок = СтрЗаменить(НСтр("ru = 'Границы включения сделок в уведомление за %ОтчетныйГод% год'"),"%ОтчетныйГод%",Формат(Объект.ОтчетныйГод, "ЧЦ=4; ЧГ=0"));
	
	ЗаполнитьГраницы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ЗаписатьГраницы();
	Закрыть();
	
КонецПроцедуры
